Билет13/src/Documents/ВводВЭксплуатацию/ВводВЭксплуатацию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводВЭксплуатацию</name>
  <registerRecords>AccumulationRegister.ОстаткиНоменклатуры</registerRecords>
  <registerRecords>AccumulationRegister.ОборудованиеВЭксплуатиции</registerRecords>
  <tabularSections>
    <name>СписокНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Билет13/src/AccumulationRegisters/ОборудованиеВЭксплуатиции/ОборудованиеВЭксплуатиции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОборудованиеВЭксплуатиции</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Себестоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СрокГодностиДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СрокЭксплуатацииДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Билет13/src/AccumulationRegisters/ОстаткиНоменклатуры/ОстаткиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиНоменклатуры</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Себестоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СрокГодностиДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Билет13/src/Documents/ВводВЭксплуатацию/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ОборудованиеВЭксплуатиции.Записывать = Истина;
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	Движения.Записать();
	Движения.ОборудованиеВЭксплуатиции.Записывать = Истина;
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	
	//БлокировкаД
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиНоменклатуры");
	ЭлементБлокировки.УстановитьЗначение("СрокГодностиДо", Новый Диапазон(Дата));
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = СписокНоменклатуры;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	Блокировка.Заблокировать();
	//старая метода
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВводВЭксплуатациюСписокНоменклатуры.Номенклатура КАК Номенклатура,
		|	СУММА(ВводВЭксплуатациюСписокНоменклатуры.Количество) КАК Количество
		|ПОМЕСТИТЬ втТЧВводимое
		|ИЗ
		|	Документ.ВводВЭксплуатацию.СписокНоменклатуры КАК ВводВЭксплуатациюСписокНоменклатуры
		|ГДЕ
		|	ВводВЭксплуатациюСписокНоменклатуры.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВводВЭксплуатациюСписокНоменклатуры.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТЧВводимое.Номенклатура КАК Номенклатура,
		|	втТЧВводимое.Номенклатура.Представление КАК НоменклатураПредставление,
		|	втТЧВводимое.Количество КАК Количество,
		|	ОстаткиНоменклатурыОстатки.СрокГодностиДо КАК СрокГодностиДо,
		|	ЕСТЬNULL(ОстаткиНоменклатурыОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ЕСТЬNULL(ОстаткиНоменклатурыОстатки.СебестоимостьОстаток, 0) КАК СебестоимостьОстаток,
		|	втТЧВводимое.Номенклатура.СрокЭксплуатацииДней КАК СрокЭксплуатацииДней
		|ИЗ
		|	втТЧВводимое КАК втТЧВводимое
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиНоменклатуры.Остатки(
		|				&МоментВремени,
		|				СрокГодностиДо >= &Дата
		|					И Номенклатура В
		|						(ВЫБРАТЬ
		|							втТЧВводимое.Номенклатура КАК Номенклатура
		|						ИЗ
		|							втТЧВводимое КАК втТЧВводимое)) КАК ОстаткиНоменклатурыОстатки
		|		ПО втТЧВводимое.Номенклатура = ОстаткиНоменклатурыОстатки.Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОстаткиНоменклатурыОстатки.СрокГодностиДо УБЫВ
		|ИТОГИ
		|	МАКСИМУМ(Количество),
		|	СУММА(КоличествоОстаток)
		|ПО
		|	Номенклатура";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНоменклатура.Следующий() Цикл
		Если ВыборкаНоменклатура.Количество > ВыборкаНоменклатура.КоличествоОстаток Тогда
		    Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = стршаблон("Не хватает %1 в кол-ве %2ед.",
										ВыборкаНоменклатура.НоменклатураПредставление,
										ВыборкаНоменклатура.Количество - ВыборкаНоменклатура.КоличествоОстаток);
			Сообщение.Сообщить();
		КонецЕсли;
	    Если Отказ Тогда
			Продолжить;
		КонецЕсли;
		Выборка = ВыборкаНоменклатура.Выбрать();
	    КоличествоСписать = ВыборкаНоменклатура.Количество;
		Пока Выборка.Следующий() И КоличествоСписать > 0 Цикл
			//списание по партиям в порядке срока годности
			ТекКоличество = Мин(КоличествоСписать, Выборка.КоличествоОстаток);  
			Если ТекКоличество = Выборка.КоличествоОстаток  Тогда
				Себестоимость = Выборка.СебестоимостьОстаток;
			Иначе
				Себестоимость  = ТекКоличество / Выборка.КоличествоОстаток * Выборка.СебестоимостьОстаток;
			КонецЕсли;
			Движение = Движения.ОстаткиНоменклатуры.ДобавитьРасход();
			Движение.Период = Дата;
			Движение.Номенклатура = Выборка.Номенклатура;
			Движение.СрокГодностиДо = Выборка.СрокГодностиДо ;
			Движение.Количество = ТекКоличество;
			Движение.Себестоимость = Себестоимость;
            КоличествоСписать = КоличествоСписать - ТекКоличество; 
			
			//запись в РН оборвЭкспл
			Движение = Движения.ОборудованиеВЭксплуатиции.ДобавитьПриход();
			Движение.Период = Дата;
			Движение.Номенклатура = Выборка.Номенклатура;
			Движение.СрокГодностиДо = Выборка.СрокГодностиДо ;
			Движение.Количество = ТекКоличество;
			Движение.Себестоимость = Себестоимость;
			Движение.СрокЭксплуатацииДо = Дата + Выборка.СрокЭксплуатацииДней * 24 * 60 * 60;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры
